blog/app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "hello world 111"], ["updated_at", "2019-07-09 08:11:10.507529"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    if @article.update(params.require(:article).permit(:title, :text))

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test 22"], ["text", "test 22"], ["created_at", "2019-07-09 08:06:29.927303"], ["updated_at", "2019-07-09 08:06:29.927303"]]
---
  def create
    @article = Article.new(params.require(:article).permit(:title, :text))
    if @article.save