blog/app/controllers/articles_controller.rb

  def create
    # @article = Article.new(params[:article])
    # @article = Article.new(params.require(:article).permit(:title, :text))
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hello world"], ["text", "text hello world"], ["created_at", "2019-07-09 07:51:05.318390"], ["updated_at", "2019-07-09 07:51:05.318390"]]